results/M6/M6-AF-20260920T211148Z/cfd/cases/af91058b6fae_coarse_c0/dictionaries/system/sampleLine
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleLine;
}
// AETHER template - upper-case placeholders between at-signs are filled by aether.cfd.case.

type            sets;
libs            (sampling);
interpolationScheme cell;          // raw cell values: no interpolation smearing the shock
setFormat       raw;
fields          (p rho T U);

sets
{
    stagnationLine
    {
        type    midPoint;
        axis    x;
        start   (-0.374529647049 6e-05 0);
        end     (-6e-10 6e-05 0);
    }
}
